---
kind: method
id: M:Autodesk.Revit.DB.Reference.EqualTo(Autodesk.Revit.DB.Reference)
source: html/f132f8e7-7a1a-2a17-af98-1d2e2bef4ca1.htm
---
# Autodesk.Revit.DB.Reference.EqualTo Method

Checks if given reference is equal to this reference.

## Syntax (C#)
```csharp
public bool EqualTo(
	Reference reference
)
```

## Parameters
- **reference** (`Autodesk.Revit.DB.Reference`) - Another reference.

## Returns
Returns true if given reference is equal to this reference, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when argument is Nothing nullptr a null reference ( Nothing in Visual Basic) .